; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	image0 - mode
	infrared1 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	Star6 - direction
	GroundStation7 - direction
	Star5 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Star8 - direction
	Star4 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star6)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star5)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument3 infrared1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star9)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon12)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 Star4)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star9)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 Star8)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
)
(:goal (and
	(pointing satellite0 Star14)
	(pointing satellite1 GroundStation0)
	(pointing satellite2 Star6)
	(have_image Phenomenon10 image0)
	(have_image Phenomenon12 infrared1)
	(have_image Star14 image0)
	(have_image Planet15 image0)
	(have_image Planet16 image0)
))

)

; plan
1. (turn_to satellite1 groundstation0 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 groundstation0)
   goals met: 1 of 8
2. (turn_to satellite0 star6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star6)
   goals met: 1 of 8
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
4. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 1 of 8
5. (turn_to satellite0 phenomenon12 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon12)
   goals met: 1 of 8
6. (take_image satellite0 phenomenon12 instrument0 infrared1)
   added: (have_image phenomenon12 infrared1)
   goals met: 2 of 8
7. (turn_to satellite0 phenomenon10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 8
8. (take_image satellite0 phenomenon10 instrument0 image0)
   added: (have_image phenomenon10 image0)
   goals met: 3 of 8
9. (turn_to satellite0 planet15 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet15)
   goals met: 3 of 8
10. (take_image satellite0 planet15 instrument0 image0)
   added: (have_image planet15 image0)
   goals met: 4 of 8
11. (turn_to satellite0 planet16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet16)
   goals met: 4 of 8
12. (take_image satellite0 planet16 instrument0 image0)
   added: (have_image planet16 image0)
   goals met: 5 of 8
13. (turn_to satellite0 star14 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star14)
   goals met: 6 of 8
14. (take_image satellite0 star14 instrument0 image0)
   added: (have_image star14 image0)
   goals met: 7 of 8
15. (turn_to satellite2 star6 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star6)
   goals met: 8 of 8
